<div id="navegacion" prev="" next="../Tema_74/t7_pandas_013.html"></div>

<div class="section-title">Sección 8.1</div>

# Importar y exportar ficheros

Aunque otras librerías de Python proporcionan herramientas para importar y exportar datos, Pandas aporta una gran potencia a la hora de leer y/o escribir ficheros de datos. 
En esta sección abordamos el tema de cómo leer y almacenar datos en diferentes formatos, ya sea en ficheros o en bases de datos. Pandas proporciona una amplia colección de funciones para realizar la lectura de datos como un objeto de tipo `DataFrame`  de una forma sencilla y flexible.

Comenzamos la Sección con el tratamiento de ficheros de texto y ficheros en formato Excel. Posteriormente abordamos el caso de la lectura de datos que se encuentrar almacenados en Bases de datos tanto SQL como NoSQL.

In [1]:
import pandas as pd
import numpy as np

## Ficheros de texto o CSV

En muchas ocasiones los datos en encuentran almacenados en ficheros de texto y representados en forma de tabla. El formato más popular es el CSV , donde los valores de cada una de las filas están separados por el símbolo coma (`,`).  En otras ocasiones, los valores de cada fila están separados por otro símbolo, un tabulador o  un espacio. Este tipo de ficheros normalmente tienen extensión `.txt`. 

La función más utilizada en pandas para leer de forma flexible ficheros de texto plano es  `pd.read_csv`. La escritura de los datos contenidos en un dataframe o una serie se realiza mediante la operación `to_csv` de las  `Series` y `DataFrame`.

### Lectura de ficheros de texto o CSV

El fichero [animals1.csv](./datos/animals1.csv) contiene información del peso medio del cuerpo y cerebro de 8 especies de animales:

```
animals1.csv
------------
Especie,Peso cuerpo,Peso cerebro
Big brown bat,0.023,0.3
Mouse,0.023,0.4
Ground squirrel,0.101,4
Tree shrew,0.104,2.5
Golden hamster,0.12,1
Mole,0.122,3
Galago,0.2,5
Rat,0.28,1.9
```

La función `pd.read_csv` permite crear un `DataFrame` a partir de los datos contenidos en un fichero en formato CSV.

In [2]:
dfcsv = pd.read_csv('datos/animals1.csv')
dfcsv

           Especie  Peso cuerpo  Peso cerebro
0    Big brown bat        0.023           0.3
1            Mouse        0.023           0.4
2  Ground squirrel        0.101           4.0
3       Tree shrew        0.104           2.5
4   Golden hamster        0.120           1.0
5             Mole        0.122           3.0
6           Galago        0.200           5.0
7              Rat        0.280           1.9

Como podemos ver, la creación de dataframes a partir de un fichero CSV es bastante sencilla.

Cuando los datos almacenados en el fichero no contienen la información  del nombre de cada una de las columnas, es decir, los datos aparecen en la primera fila del fichero (ver el fichero [animals2.csv](datos/animals2.csv)), podemos indicar mediante el argumento `header` la ausencia de cabeceras. 

```
animals2.csv
------------
Big brown bat,0.023,0.3
Mouse,0.023,0.4
Ground squirrel,0.101,4
Tree shrew,0.104,2.5
Golden hamster,0.12,1
Mole,0.122,3
Galago,0.2,5
Rat,0.28,1.9
```

Las columnas del dataframe se indexan de forma automática con valores de tipo `int` comenzando por el valor `0`.

In [3]:
dfcsv = pd.read_csv('datos/animals2.csv', header = None)
dfcsv

                 0      1    2
0    Big brown bat  0.023  0.3
1            Mouse  0.023  0.4
2  Ground squirrel  0.101  4.0
3       Tree shrew  0.104  2.5
4   Golden hamster  0.120  1.0
5             Mole  0.122  3.0
6           Galago  0.200  5.0
7              Rat  0.280  1.9

Usando el argumento `names` de la función `pd.read_csv` es posible asignar un nombre más significativo a cada una de las columnas:

In [4]:
dfcsv = pd.read_csv('datos/animals2.csv', 
                    header = None, 
                    names = ['Especie', 'Peso Cuerpo', 'Peso cerebro'])
dfcsv

           Especie  Peso Cuerpo  Peso cerebro
0    Big brown bat        0.023           0.3
1            Mouse        0.023           0.4
2  Ground squirrel        0.101           4.0
3       Tree shrew        0.104           2.5
4   Golden hamster        0.120           1.0
5             Mole        0.122           3.0
6           Galago        0.200           5.0
7              Rat        0.280           1.9

En algunas ocasiones las primeras líneas del fichero no se corresponden con datos propiamente dichos, si no que símplemente aportan una descripción de los datos que contiene (ver [peliculas.csv](datos/peliculas.csv)).

```
peliculas.csv
------------
Cine de los 90
*********************************
Estreno: Fecha de estreno
Nombre: Título de la película
Cat: Género de la película
*********************************
Estreno,Nombre,Cat
1982,E.T. the ExtraTerrestrial,Fantasy
1982,Poltergeist,Horror
1992,Alien,Action
1992,The Crying Game,War
1995,Toy Story,Animation
1995,GoldenEye,Action
1995,Four Rooms,Thriller
```

El argumento `skiprows` permite omitir la lectura de un número determinado de filas al comienzo del fichero.

In [5]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6)
dfcsv

   Estreno                     Nombre        Cat
0     1982  E.T. the ExtraTerrestrial    Fantasy
1     1982                Poltergeist     Horror
2     1992                      Alien     Action
3     1992            The Crying Game        War
4     1995                  Toy Story  Animation
5     1995                  GoldenEye     Action
6     1995                 Four Rooms   Thriller

También es posible omitir la lectura de ciertas filas indicándolo mediante una lista de filas en el argumentos `skiprows`.

In [6]:
dfcsv = pd.read_csv('datos/peliculas.csv', 
                    skiprows = [0, 1, 2, 3, 4 , 5, 6, 7, 8, 9])
dfcsv

   1992 The Crying Game        War
0  1995       Toy Story  Animation
1  1995       GoldenEye     Action
2  1995      Four Rooms   Thriller

Para crear variables de tipo  `DataFrame` donde los valores de una de las columnas en el fichero se van a convertir en el índice del dataframe, usamos el argumento `index_col`:

In [7]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6, 
                    index_col = ['Estreno'])
dfcsv

                            Nombre        Cat
Estreno
1982     E.T. the ExtraTerrestrial    Fantasy
1982                   Poltergeist     Horror
1992                         Alien     Action
1992               The Crying Game        War
1995                     Toy Story  Animation
1995                     GoldenEye     Action
1995                    Four Rooms   Thriller

También es posible crear dataframes donde el índice se compone de varias columnas del fichero; se trata de índices jerárquicos. Por ejemplo, podemos usar el argumento `index_col` con la lista de columnas del fichero que formará el índice del dataframe creado:

In [8]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6, 
                    index_col = [0, 1])
dfcsv

                                         Cat
Estreno Nombre
1982    E.T. the ExtraTerrestrial    Fantasy
        Poltergeist                   Horror
1992    Alien                         Action
        The Crying Game                  War
1995    Toy Story                  Animation
        GoldenEye                     Action
        Four Rooms                  Thriller


Cuando los ficheros de datos que queremos procesar son muy grandes, pandas ofrece la posibilidad de realizar una lectura por partes. Esta opción permite procesar solo una parte de los datos. El argumento `nrows` permite procesar un numero determinado de filas del fichero, mientras que el argumento `skiprows` permite indicar las filas que no queremos procesar.

In [9]:
dfcsv = pd.read_csv('datos/peliculas.csv', skiprows = 6, nrows =2)
dfcsv

   Estreno                     Nombre      Cat
0     1982  E.T. the ExtraTerrestrial  Fantasy
1     1982                Poltergeist   Horror

### Escritura de datos en ficheros CSV

Los datos almacenados en las estructuras de datos de Pandas, ya sea en `Series` o `DataFrames`, pueden ser almacenados en ficheros. Esta es una operación se realiza de forma habitual después del procesamiento de datos, limpieza, etc.
Por ejemplo, para escribir los datos incluídos en un DataFrame en un fichero CSV utilizamos el método `to_csv` con el nombre del fichero como argumento.

In [10]:
dfcsv = pd.read_csv('datos/peliculas2.csv', index_col = ['Estreno'])
dfcsv

                            Nombre  Minutos
Estreno
1982     E.T. the ExtraTerrestrial      114
1982                   Poltergeist       91
1992                         Alien      144
1992               The Crying Game      113
1995                     Toy Story       81
1995                     GoldenEye      130
1995                    Four Rooms       94

Admite una gran cantidad de parámetros. Opcionalmente podemos generar un fichero csv con cabeceras o sin ellas, con índices o sin ellos.

In [11]:
dfcsv.to_csv('./datos/datos.csv')

```
datos.csv
------------
Estreno,Nombre,Minutos
1982,E.T. the ExtraTerrestrial,114
1982,Poltergeist,91
1992,Alien,144
1992,The Crying Game,113
1995,Toy Story,81
1995,GoldenEye,130
1995,Four Rooms,94

```


Como se puede ver en el ejemplo, tanto el índice como las columnas del DataFrame se escriben en el fichero. Los argumentos `index` y `header` permiten cambiar el comportamiento por defecto:

In [12]:
dfcsv.to_csv('./datos/datos.csv', header = True, index = False)

```

datos.csv
------------
Nombre,Minutos
E.T. the ExtraTerrestrial,114
Poltergeist,91
Alien,144
The Crying Game,113
Toy Story,81
GoldenEye,130
Four Rooms,94
```

En éste punto nos preguntamos qué sucede con los valores `NaN` existentes en un dataframe. Por defecto, los valores `NaN` se muestran como campos vacíos en el fichero.

In [13]:
col = [ 1, 2, np.nan, 4, np.nan, np.nan, np.nan]

dfcsv.insert(1, 'Nueva Columna', value = col)
dfcsv

                            Nombre  Nueva Columna  Minutos
Estreno
1982     E.T. the ExtraTerrestrial            1.0      114
1982                   Poltergeist            2.0       91
1992                         Alien            NaN      144
1992               The Crying Game            4.0      113
1995                     Toy Story            NaN       81
1995                     GoldenEye            NaN      130
1995                    Four Rooms            NaN       94

In [14]:
dfcsv.to_csv('./datos/datos.csv', header = True, index = False)

```
datos.csv
------------
Nombre,Nueva Columna,Minutos
E.T. the ExtraTerrestrial,1.0,114
Poltergeist,2.0,91
Alien,,144
The Crying Game,4.0,113
Toy Story,,81
GoldenEye,,130
Four Rooms,,94
```

El argumento `na_rep` permite reemplazar los valores `NaN` del dataframe por otros que elija el usuario.

In [15]:
dfcsv.to_csv('datos.csv', header = True, index = False, na_rep = 0)

```
datos.csv
------------
Nombre,Nueva Columna,Minutos
E.T. the ExtraTerrestrial,1.0,114
Poltergeist,2.0,91
Alien,0,144
The Crying Game,4.0,113
Toy Story,0,81
GoldenEye,0,130
Four Rooms,0,94
```

Aunque los ejemplos anteriores solo tratan con dataframes, el comportamiento es análogo si tratamos con series.

## Ficheros en formato Microsoft Excel

Otra forma muy habitual para guardar datos en forma tabular es mediante hojas de cálculo en un libro o fichero de Microsoft Excel. Pandas incluye la función `pd.read_excel` para realizar la lectura de datos y crear dataframes, mientras que el método `to_excel` de los `Dataframe` permite escribir los datos en una hoja de cálculo de Microsoft Excel.

### Lectura de ficheros Excel

La función `pd.read_excel` permite crear objetos de tipo `DataFrame` a partir de los datos contenidos en ficheros con extensión `.xls` y `.xlsx`. La siguiente figura  muestra el contenido de dos hojas contenidas en el fichero [clientes.xlsx](./datos/clientes.xlsx).

<img src="./images/imagenExcel.jpg">

Por defecto, la función `pd.read_excel` lee los datos de la primera hoja dentro del libro, pero se puede indicar que lea los datos de otra hoja usando el argumento `sheet_name`.

In [16]:
dfexcel = pd.read_excel('./datos/clientes.xlsx') 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   ROSA ELVIRA    F
1  CLI-0003  MIGUEL ANGEL    M
2  CLI-0004     ANA MARIA    F
3  CLI-0013    BRIGGITTE     F
4  CLI-0018   SAULO ANDRE    M
5  CLI-0020        MONICA    F

In [17]:
dfexcel = pd.read_excel('./datos/clientes.xlsx', sheet_name = "Hoja2") 
dfexcel

     CODCLI  EUROS     MAX
0  CLI-0001  89574  100000
1  CLI-0019  68752   80000
2  CLI-0020  63014   70000

La función `pd.read_excel` es tan flexible como lo pueda ser la función `pd.read_csv` para ficheros de texto. Es posible saltar cabeceras, leer un número determinado de filas, leer solo algunas de las columnas contenidas en la hoja de cálculo, etc. Su funcionamiento varía dependiendo de los valores de los argumentos cuando se invoca la función. 

En el siguiente ejemplo aplicamos una función de conversión (función `funtitle` previamente definida) a los valores contenidos en la columna `NOMCLI` de la primera hoja del fichero.

In [18]:
def funtitle(cadena):
    return cadena.title()

dfexcel = pd.read_excel('./datos/clientes.xlsx', converters = {'NOMCLI': funtitle}) 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   Rosa Elvira    F
1  CLI-0003  Miguel Angel    M
2  CLI-0004     Ana Maria    F
3  CLI-0013    Briggitte     F
4  CLI-0018   Saulo Andre    M
5  CLI-0020        Monica    F

O lo que es lo mismo, pero usando funciones anónimas:

In [19]:
dfexcel = pd.read_excel('./datos/clientes.xlsx', 
                      converters = {'NOMCLI': lambda x: x.title() }) 
dfexcel

     CODCLI        NOMCLI SEXO
0  CLI-0001   Rosa Elvira    F
1  CLI-0003  Miguel Angel    M
2  CLI-0004     Ana Maria    F
3  CLI-0013    Briggitte     F
4  CLI-0018   Saulo Andre    M
5  CLI-0020        Monica    F

El argumento `converters` recibe como valor un diccionario, cuyas claves son las columnas sobre las que se va a aplicar una función de conversión. El valor asociado a cada clave es la función a aplicar. Observa que esta función se ha definido como una función lambda.

En el fichero de Microsoft Excel [clientes1.xlsx](./datos/clientes1.xlsx) que se muestra a continuación:

<img src="./images/imagenExcel2.jpg">

La columna `TLF` tiene valor `-` en aquellas celdas donde no se conoce el dato, mientras  que la columna `SEXO` tiene celdas con valor `Desconocido`. También podemos observar que la columna `NOMCLI` tiene una celda vacía. En el siguiente ejemplo mostramos cómo manejar estas situaciones:

In [20]:
dfexcel = pd.read_excel('./datos/clientes1.xlsx', 
                      na_values = {'SEXO': ['Desconocido'],
                                   'TLF' : ['-'] } ) 
dfexcel

     CODCLI        NOMCLI SEXO     TLF
0  CLI-0001   ROSA ELVIRA    F  7578.0
1  CLI-0003  MIGUEL ANGEL  NaN     NaN
2  CLI-0004     ANA MARIA  NaN     NaN
3  CLI-0013    BRIGGITTE     F     NaN
4  CLI-0018   SAULO ANDRE    M     NaN
5  CLI-0020           NaN    F  7600.0

El argumento `na_values` permite sustituir valores contenidos en la hoja de cálculo por `NaN`. Dicho argumento recibe un diccionario, cuyas claves son las columnas sobre las que se va a aplicar la sustitución, y el valor de cada clave es la lista de valores que han de ser sustituidos por `NaN`. Las celdas vacías en la hoja de cálculo se transforman automáticamente en `NaN` en el dataframe.

### Escritura en ficheros Excel

Pandas también ofrece la posibilidad de escribir los datos incluídos en un DataFrame en
una hoja de un fichero Excel. Para ello usamos el método `to_excel` de los `DataFrame` indicando el nombre del fichero. Los argumentos `header` e `index` , discutidos en el caso del método `to_csv`, también están disponibles aquí.

In [24]:
dfexcel.to_excel('clientes4.xlsx', index = False)

Se puede observar que los valores `NAN` del dataframe pasan a ser celdas vacías en la hoja de cálculo, pudiéndose usar el argumento `na_rep` para cambiar el comportamiento.

<img src="./images/imagenExcel3.jpg">

En el siguiente ejemplo usamos el argumento `sheet_name` para asignar un nombre a la hoja de cálculo creada entro del fichero y el argumento `columns` para indicar el subconjunto de columnas que queremos llevar a la hoja de cálculo.

In [25]:
dfexcel.to_excel('clientes5.xlsx', index = False, 
                   sheet_name='mis datos', 
                   columns = ['NOMCLI', 'SEXO'],
                   na_rep='--')

<img src="./images/imagenExcel4.jpg">

El método `to_excel` tiene ciertas limitaciones. Por ejemplo, cuando queremos escribir los datos de distintos dataframes en distintas hojas de cálculo dentro del mismo libro.
La clase `ExcelWriter` de Pandas resuelve éste problema.

En el siguiente ejemplo, mostramos cómo se crea un libro de Microsoft Excel mediante la función `pd.ExcelWriter`. Posteriormente, mediante el método `to_excel` escribimos los datos de distintos dataframes en distintas hojas, dentro del mismo fichero.

In [26]:
df1 = dfexcel.loc[:, ['NOMCLI', 'SEXO']]
df1

         NOMCLI SEXO
0   ROSA ELVIRA    F
1  MIGUEL ANGEL  NaN
2     ANA MARIA  NaN
3    BRIGGITTE     F
4   SAULO ANDRE    M
5           NaN    F

In [27]:
df2 = dfexcel.loc[:, ['CODCLI', 'TLF']]
df2

     CODCLI     TLF
0  CLI-0001  7578.0
1  CLI-0003     NaN
2  CLI-0004     NaN
3  CLI-0013     NaN
4  CLI-0018     NaN
5  CLI-0020  7600.0

## Referencias

* [Big Data. Análisis de datos con Python. Sarasa Cabezuelo, Antonio; García Ruiz, Yolanda Aditorial Garceta. ISBN: 978-84-1622-883-6](http://www.garceta.es/libro.php?ISBN=978-84-1622-883-6)

* [Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do)

------

------------